{
	"content": {
		"relationships": [
			{
				"type": "post",
				"title": "Conventional dating is stupid",
				"text": "I hate how couples label their meaningless phases of interaction: 'we're talking' or 'we're texting' and then 'we're dating'. Once they start dating, monthly anniversaries are celebrated. In some cases I've even seen weekly anniversaries celebrated with GIFTS. Seriously, what the fuck is that shit?! Then, these couples have certain criteria for texting. My boyfriend needs to text me every night a good night text. Or, more criteria like: I can't look at another girl my girlfriend will kill me. Some of y'all make up TOO MANY stupid ass RULES for dating. It's about connecting with a person. Stop with the labels and the regulations like you're a communist nation or some shit…Toxic relationships are not a thing I hear people, mostly women, speaking about how they broke up with their s.o. because the relationship was toxic. But what that really means is that one or both of the people in the relationship are behaving in a toxic manner. A relationship is not its own entity. It cannot be inherently toxic without actions taken from the individuals So basically to me it just sounds like a way to absolve yourself of responsibility. As in, you are one half of this relationship, if the relationship is 'Toxic then you are at least half of the reason for that, not the relationship, you. Breaking up with your s.o. will not lead to a healthier relationship if you are not willing to accept your part of the blame for why the relationship is not working. So stop with this vacuous 'The relationship was just toxic' bullshit. You are a 'toxic' (I don't really like that term) person, poisoning your relationship and telling yourself it was not your fault, as the relationship itself was toxic. When everyone knows that is not true."
			}, 
			{
				"type": "post", 
				"title": "I don't think breaking up with someone is that fucking hard.",
				"text": "People who stay in loveless relationships for years because they've invested so much time that they're afraid to be alone? I think they're weak."
			},
			{
				"type": "post", 
				"title": "If you are in a relationship, you shouldn’t be hanging out with straight friends of the opposite sex alone.",
				"text": "I don’t give a fuck that 'they’re only like a brother/sister' to you and that you’d never date them. It’s simply disrespectful to your SO. How do you not see it weird when your walking out the door saying, 'Bye, SO, I’m heading out to the movies with (insert name of straight opposite sex friend here).'"
			},
			{
				"type": "post",
				"title":"Kids ruin relationships",
				"text":"I plan on never having children, and luckily for me, my girlfriend agrees. Every divorce I've seen is always after children. Kids put too much pressure on you. They're expensive, annoying, and take time away from being with your loved one. They're constantly with you, holding back your sex life. They ruin relationships. I want a good future with my girlfriend, not a shitty one held back by children in my house."
			},
			{
				"type": "post",
				"title": "Saying 'Significant other' is stupid",
				"text": "Everytime someone shorthands it online as SO I instantly think it means superior officer. It's so stupid. Wish people would just say boyfriend/girlfriend/partner instead."
			},
			{
				"type": "post",
				"title": "Romantic relationships are NOT enjoyable.",
				"text": "I'm not trying to be a pessimist. It's just... the media has made it seem like romance equals happiness. I just don't understand it.In my experience, relationships are quite sad. There'"
			},
			{
				"type": "post",
				"title": "There is absolutely nothing wrong with promiscuity or having polyamorous ",
				"text": "This is assuming the person(s) engaging in casual sex or in a polyamourous relationship is taking the appropriate measures to protect against STDs or pregnancy. Why must people belong to a two person relationship or why must people have a relationship at all even if they clearly have sexual needs? Sex is not this 'mystical' thing that is somehow better if you do it with someone who you have an exclusive relationship with. Some people might be more into it if they love their partner but many people do not give the slightest fuck about that and love sex for sex. Anyways, as long what people are doing does not threaten others, why is doing what they enjoy such a bad thing? Furthermore, why does there remain such a greater stigma towards women who are promiscuous? They are no different as a person than a woman who practices monogamy, they just have a different preference for how things work when they want to have fun. People really need to stop fucking judging others for the harmless actions of those just trying to have fun."
			},
			{
				"type": "post",
				"title": "I don't understand the taboo of talking about past relationships with new partners",
				"text": " It seems like there's this giant prohibition on any in-depth discussion of ex-lovers with new ones and I think it's just silly. Obviously it wouldn't be appropriate for the first few dates, but it's almost like any amount of discussion of previous romantic partners is met with the assumption that you're not over it, you have major emotional baggage, and you're the jealous type who's going to stalk the ex’s. But me? I dunno; I genuinely enjoy talking about relationships and I don't see the harm in getting the details out in the open. I think it's fun and interesting and it teaches you a lot about another person. Why do we have to pretend our ex's are completely irrelevant? It just seems strange to me."
			},
			{
				"type": "post",
				"title": "If you're a single parent, you should leave the dating pool for 18 years, or until your kid/s are out of the house.",
				"text": "You fucked up. Your dating life is over. As a fit mid 20s male, I would never date someone with kids. I doubt I'll change my mind in my 30s or 40s. I assume everyone who is not a blob has similar opinions."
			},
			{
				"type": "post",
				"title": "Some people deserve to be alone",
				"text": "If you're a pathetic sad sack who spends all day whining about how pathetic and sad you are and how you'll never get a relationship or sex, you deserve to be alone. Who is going to choose to spend their limited time on this earth with someone who's such a fucking downer? If everything you write or say sounds like a suicide note, no one is going to want to be your friend. Get some therapy, get some meds, just fucking do something instead of sitting around a circle-jerky sub telling each other how pathetic you all are."
			},
			{
				"type": "post",
				"title": "You should listen to your jealousy",
				"text": "Ok this is going to come off harsh... Anyhow jealousy is a very smart emotion. When your gut is telling you your girlfriend might cheat on you, she might actually cheat on you, simply because she can. Unless she's in a vegetative state and physically incapable to cheat, you can never know for sure. You see, jealousy is there to protect you. It doesn't necessarily mean you're insecure. Sometimes it just means you're intelligent. There's sexual cheating, then there's emotional cheating. And there's attention cheating. And infinite other kinds of cheating, because what qualifies as cheating varies from person to person. That is precisely why you should always, ALWAYS set the boundaries right in the beginning of the relationship. Yes, I am quite aware that there are people who are totally okay with any extra-relational behavior. Good for them. Jealousy should help you set boundaries for your partner. You DO have a right to tell them what they can and can't do. If they really are trustworthy they will respect the boundaries you set and if they value the relationship they should be attentive to your needs. Someone who's in a relationship should take what they're doing into consideration at all times. Only ever feel secure in a relationship when you know that it is secure."
			},
			{
				"type": "post",
				"title": " I'm not attracted to very beautiful girls.",
				"text": "I don't mean like above average pretty girls you'd definitely like to sleep with, i'm talking about very modelesque big breasted, hourglass figured, long haired, blue eyed beauty that everyone seems to flip the hell out over. They just seem like cookie cutter conveyor belt women who don't even exist outside of tv. Maybe it's because I know they're out of my league lol, but seriously, if given the opportunity I'd pick the girls in my dating range any day simply for the fact that I'd feel like a fucking slug waking up next to someone like that every day. Give me a 5'0' short haired average girl with pretty eyes and a decent body any day and I'd be a happy man."
			},
			{
				"type": "post",
				"title": "Interracial Dating is not cool",
				"text": "Staying within your race will alleviate so much BS so why do it? I'm 1/2 of an interracial marriage and I've experienced it in the west and the east and I wouldn't wish the hardship on anyone."
			},
			{
				"type": "post",
				"title": "Fuck online dating.",
				"text": "I am awful tired of online dating. Can we stop shopping for a partner like we're shopping for a car and just hang out and get to know each other a bit? I'm sick of the word 'dealbreakers.' How about you get to know someone before you put on your judgey pants. Stop viewing everyone you meet through a filter of 'the ideal partner' and just enjoy someone's company for five minutes. No, I don't consider 'doesn't like football,' or 'isn't willing to give me kids right away,' to be valid 'dealbreakers.' No I'm not gonna marry you and give you babies just because you're pretty. You better be prepared to earn that shit, because if your highest ambition is 'to become a mother,' then you're already boring me. Not that there's anything wrong with that ambition, and I'm not going to judge or dismiss you for doing things that bore me. Both men and women these days come to the first date with a laundry list of attributes they expect, and if you don't get enough checks on that checklist, you better just check out mister. We're all human beings, y'all, this isn't a damn car dealership. If you're open minded you might even find out you like someone. And, yeah, I like an ambitious woman, yeah I prefer a chubby body type, but no I don't make those absolute requirements to get to know me. Maximum frustration! Oh, and guess what. If you're a 30+ year old woman with no goals, no passions, working at the corner store, and living with your parents then it turns out you're not too good to talk to me you fucking loser. To be clear, I'm not calling out any one person here; this just seems to be a trend. Yeah, life is hard; I worked my ass off to get to where I am today, and I never could have done it without my parents' support. I understand the struggle, but get off your high fuckin' horse and give a man a chance before you decide he's not good enough to even talk to."
			},
			{
			"type": "post",
			"title": "Tinder is not for men.",
			"text": "I have not used Tinder in over a year and for good reason. I've never had trouble meeting girls or finding dates. Tinder seemed like a great way to streamline dating. Instead of trying to find single girls to date in public I now had an app and everyone on it was single. Wow, was I naive in assuming that there would just be an app full of wonderful, selfless people lining up to split the cost of meals and entertainment. I went on probably 50 dates with about 15 girls or so. Not one of these girls offered to split the cost of anything ever. I usually ask on the second date if the girl wants to split it and all of them had some well crafted way of getting out of paying their share. Some of the girls straight up told me they thought the man should pay for things, others told me they found it unattractive that I would ask, several just kind of gave me a dirty look. Half of these girls had been on some big vacation in the last few months or so which is just odd because none of them had very good jobs that would afford them international vacations. After a while it occurred to me that most of these girls basically never paid for anything in their lives and Tinder was just a way to get free food every day or find a guy to take them on a vacation that they wouldn't pay for. It's been over a year since I used Tinder and I still have not recovered my faith in humanity. Tinder is cancer!"
			},
			{
			"type": "post",
			"title": "We need affirmative action in the sex/dating world.", 
			"text" : "Women should be required to have sex with men who can't get laid to compensate the sexual discrimination that they face. Hot guys should be banned from fucking hot girls. The hotter the woman, the more virgin men she should be required to have sex with. The uglier/poorer the man (or the lower the chance of him scoring), the more women he should be allowed to legally obtain for sex. Lookism is a legitimate form of discrimination and perhaps worse than sexism because at least you can 'identify' as a different gender. We need sexual communism to stop sexual discrimination against unattractive males. They can't help that they are ugly. If a woman REALLY doesn't want to participate in the Affirmative Action Program to help ugly virgin men (e.g. Maybe religious) or if she's EXTREMELY ugly then she should pay a lot of tax to buy lonely men sexbots. (It's not rape because she has a choice--either pay up or fuck.) All virgin/ugly males should get a free sex robot. There should be a limit of how many sexual partners an attractive/rich guy can have. The hotter the woman, the less attractive sexual partners that she should be allowed to have (but are allowed to fuck as many ugly/virgin men that they want). Fucking more attractive people than you can will result in a large fine. Sexual communism in the sexual market is the only way we can have peace, reduce male loneliness and sexual frustration, and prevent more Elliot Rodgers from appearing."

			},
			{
				"type": "quote",
				"title": "Both men and women keep repeating the same dating mistakes while they’re not getting any younger.",
				"text": ""
			},
			{
				"type": "quote",
				"title": "I don’t believe in living together before marriage.",
				"text": ""
			},
			{
				"type": "quote",
				"title": "You shouldn't worry if you’re being friendzoned",
				"text": ""
			},
			{
				"type": "quote",
				"title": "Getting to know someone is overrated.",
				"text": ""
			},
			{
				"type": "article",
				"title": "It’s Totally Okay To Be Clingy In Relationships",
				"text": "If you google the phrase 'clingy in a relationship', pretty much 9 out of 10 search results will come up with a negative, dismissive tone while the remaining 1 is probably urban dictionary explaining what clingy means.  \n  'Clingy' has long been deemed as one of the most undesirable traits that could instantly turn off any level of interest. It’s the bomb you drop on the first date if you want to send any dating prospect off to NOPEville. In a nutshell, no one, I repeat, no one wants to be seen as clingy.  \n  However, nowadays people throw that word around too easily and sometimes people are wrongfully labelled clingy. Though, even if they’re really being clingy, it doesn’t always have to be such a bad thing. Here’s the reason why it’s totally okay to be clingy in a relationship:  \n  It’s normal and okay to want to spend a lot of time with your girlfriend/boyfriend/partner.  \n  When you really like someone, no matter at what stage of the relationship, there’s absolutely nothing wrong about wanting to be with the star of your dreams all the time. It’s in our human nature. It’s just as basic as feeling hungry and wanting food.  \n   In most cases, the clingy lover is actually the lover whose needs aren’t met, who doesn’t feel appreciated in the relationship and that’s why it brings up insecurities and consequently, leads to attention-seeking behaviors. Inherently, it’s not the clingy lover that is wrong. It’s simply that their desires just aren’t reciprocated on the expected level.  \n  So instead of blaming yourself for 'being too much' and trying to fix what isn’t wrong in the first place, know that it’s okay to feel this way and communicate with your partner openly and honestly about your needs.  \n  Someone who complains you’re too clingy might well be just not that into you.  \n  Let’s stop for a second and ask yourself this: If you really, really like someone, would you be annoyed by this person wanting to be with you call it clingy, or would you wish to see them all the time and get jumpy and excited whenever you hear from them?  \n  I don’t know about you but I would be so damn happy and flattered if my crush was ever clingy to me! Even when I need my me time, because I like him so much, I wouldn’t react negatively to his desire to be with me no matter how intense (I wish, seriously!), or use it as a reason to break off.  \n  If someone breaks off with you because you’re too clingy, unless you’re at restraining-order-required level, sorry my dear, chances are high they’re already put off by other reasons and your clingy triple texts ain’t one. If anything, it’s probably just the last drop that makes the cup run over.  \n  If that’s how you love, then be it.  \n  Some might say clinginess comes from insecurities which means it needs to be fixed. However, for some people, it’s just who they are and the way they love. They need that much of attention and contact. They are that intense, that passionate, that crazy for love. So be it.  \n  There’s no shame in being true to yourself. Actually, you should be true to yourself all the time and embrace every ounce of that clinginess if there’s any. Just because someone doesn’t want you the same and thinks you’re being clingy doesn’t mean everyone agrees with that or there’s something wrong with you.  \n  To be fair, whether someone is clingy or not is totally relative. Do you know that clingy isn’t even a thing in some Eastern societies, for example Chinese or Vietnamese? These collectivist cultures don’t promote independence and so in relationships, couples stick together all the time and clingy is even what’s considered normal.  \n  There are people who want a clingy lover.  \n  Remember this: You’re not for everyone. You’re for the people who value you and appreciate you for everything you are including being clingy if that’s how you love. There are many, many people out there who would love to be with a clingy lover, who think your level of clinginess is absolutely healthy and normal and flattering. Don’t settle for less than that. Maybe you just haven’t found the right one yet.  \n  That being said, if you believe being clingy is in fact an indicator of a much deep-rooted emotional wound, or it has consistently posed a problem to all of your relationships or even your life, do look into it and make some changes, or even ask for help. This is the chance to learn more about yourself and find out what works best for you!"
			}
		],
		"weddings": [
			{
				"type": "post",
				"title": "Weddings aren't a big deal.",
				"text": "Weddings are beautiful and special, but I personally don't see myself getting hyped over wearing an over-priced white gown and having 100 people witness me declare my love for someone. I wouldn't mind just having close family as witnesses and getting legally married in a courthouse. I wouldn't have to stress about showing off what I can buy for my wedding, wouldn't have to spend the first few years of my marriage paying off the wedding, etc. I've been to a few weddings and I think they're wonderful, but I don't see the point in spending so much and putting so much importance into a celebration that symbolizes the love when I can cherish the love itself."
			},
						{
				"type":"quote",
				"title": "Long engagements (over a year) reek of 'I put on a ring on her to shut her up & she will be a forever fiance'",
				"text": ""
			}, 
			{
				"type": "quote", 
				"title": "Getting engaged when you have no money for a wedding at all is not only stupid, but thirsty and weird. Not romantic.",
				"text" : ""
			},
			{
				"type": "quote", 
				"title": "Father-Daughter dances are creepy and uncomfortable as hell. A cousin of mine danced to a song called “I loved her first” at her wedding. Just no..",
				"text": ""
			},
			{
				"type": "quote", 
				"title": "The Wobble, Cupid shuffle, etc are all terrible and shouldn't be played.", 
				"text" :""
			},
			{
				"type": "post", 
				"title": "I don't think the event should be alllll about the bride and groom.",
				"text": "You're inviting everyone to a party and all of the planning should revolve around showing them the best time. Obviously the bride and groom should have an amazing day, but planning everything to only their taste is selfish when you could just elope."

			},
			{
				"type": "post",
				"title": "Wedding cake sucks",
				"text": "I don't need or want all this icing, the sponge is dominated by this sugary bullshit that makes me cringe to oblivion. Their should be a beauty in the simplicity of the cake not all this awful decorative shit which I'm not really sure is even edible added with the stupid amount of icing. Fuck you wedding cakes, I'd have plain sponge with some jam in the middle over you anytime."
			},
			{
				"type": "post",
				"title": "I don't like getting invited to weddings",
				"text": "I absolutely love weddings of people I'm close to, but there's very few of those. I hate getting invitations to weddings of people I just know, and don't speak to on an almost-daily basis. Even if I'm happy for them, it always feels awkward after the ceremony when I'm sitting at a table trying to eat a buffet with a room full of strangers. We all know weddings are so busy, so you barely get to see the bride and groom, and don't even get me started on the inconvenience of out of town weddings when it's not my best friend. I'm married myself, and absolutely loved my wedding, but had a guest list of 90 people, and only 10 of those were not related to myself or my husband, so I hope I didn't impose anyone to join my nuptials in an awkward 'not good enough to be besties, but rude to decline the invite' positon. (PS: This may not be an unpopular opinion for men, but literally every woman I've talked to LOVES weddings - even as a guest to a total stranger's wedding)"
			},
			{
				"type": "post",
				"title": "Non-virgins should not wear white on their wedding day",
				"text": "I was at a wedding for an aunt the other day, and I had this thought. She's been married twice before, and in between and before both marriages, she slept with dozens of men. I'm not bitter about her life choices, but I feel like the point of wearing white means that the person has remained 'spotless.' When they haven't, it feels like it sort of destroys the meaning."
			},
			{
				"type": "post",
				"title": "There's no such thing as a beautiful fat bride",
				"text": "A fat woman in a wedding dress is ugly. It looks like a beached albino whale.Most women strive to look their most beautiful on their wedding day, going all out by getting their hair, nails and make up professionally done, spending thousands an a beautiful dress, and trying to be in a peak physical condition. Even average sized women go on wedding diets. But it's like some fat women can't be bothered. It's not like their wedding day is a surprise, they have months and sometimes even a year or two to lose the fat, but no, they choose to stay fat for their wedding. Fine, it's their choice, but they can't expect people to just flat out lie to their faces and tell them how beautiful they are. I cringe every time I see a photo of a fat bride on social media and read the comments where people tell the bride how beautiful she looks. If a fat married woman eventually decides to change her life and lose the weight, she will forever have her ugly, fat wedding photos to look at."
			},
			{
				"type": "post",
				"title": "Weddings make me feel sick",
				"text": "So I have to go to my 'friends' wedding on Saturday and im already dreading it. I hate weddings. For a start this wedding is in a church and these people are not even religious so i have issues with that. It all seems so fake and contrived, its like they just wanna get married as they feel society has dictated that they should. And I'm already getting all the 'when are you going to get married?' bullsh*t, and then i have to explain my reasons why i dont ever want to get married and just end up looking and sounding like a miserable ba**ard because i dont want to 'follow the crowd' and conform to that lifestyle like everyone else around me seems to want to. I cant bail out of this one either, as they have already paid money for me (for the meal and crap like that) and i already bailed out of another friends weddings earlier this year, so i get the feeling people will think im jealous or something if i bail again. And because of this recent influx of wedding amongst people i know, three other 'friends' have announced that their jumping on the wedding bandwagon too, so ive got three more wedding to look forward too.I'm sure I'll get buried in this thread. But I haven't seen anyone mention the cake cutting (I guess that means my opinion must be really unpopular!). I like wedding cakes. I like eating them. I like marveling at the baker's craft. I don't like standing around in a crowd craning to watch the couple feed each other strictly for an outdated photo op. Then they do that awkward arm hook and freeze/hover while everyone and their dog snaps a photo. Oh gosh! Is he going to smash it in her face? Or will she do the smashing?! Cue laughter. Ugh. Same story, at every wedding ever."
			},
			{
				"type": "quote",
				"title": "Having a bunch of bridesmaids or a big wedding party looks extremely tacky.",
				"text": ""
			},
			{
				"type": "quote",
				"title": "Destination weddings are stupid.",
				"text": ""
			},
			{
				"type": "article",
				"title": "Weddings Are a Stupid Waste of Money",
				"text": "I’m usually not one to give Dr. Phil any credence; I hate that self-righteous, twangy, moustachioed cue-ball. But he did say one thing that struck me as genius.  \n  A woman on his show was pouring some huge amount of money into her wedding, and as a reason for this irresponsible, childish behavior, she said, “But I’ve always dreamed of my wedding.”  \n  “Well, I’ve always dreamed of playing in the NBA,” he told her, invoking his most patronizing sing-song so it sounded like enn-bee-aaaaay. “That doesn’t mean I get to suit up and play.”  \n  Point taken. When I was 9, I thought I was going to marry a horse, for heaven’s sake. (Wait. Actually, I kind of did that; my husband is 6”4.) Just because we were brainwashed into thinking a wedding is the ultimate entitlement doesn’t mean we have to act on it.  \n  I Learned Better the Second Time Around  \n  I’ve had two weddings. One cost about $20,000 and had 150 guests. It was really fun, and I cut a lot of corners and was proud of how little I (my parents) spent. The second time around, there was no way I was going to ask for their financial input yet again. The total cost was $6,000, it was just as fun, and we had the rest of our savings for the three months of unpaid leave I ended up having to take a few months later to care for our premature baby.  \n  Now, I realize putting those things in the same paragraph might seem unfair, but it’s actually the perfect way to illustrate what I am talking about. Because maybe you’re a bajillionaire with stacks of money placed together to form an end-table on which you have a lamp that burns $100 bills, in which case, go on with your bad self at Lake Como across from George Clooney.  \n  Or maybe you’re just a regular woman who really does have a secret desire for Your Day and you need to be talked down. So I’ll say it again: Because we kept the wedding to a reasonable party level, we had a big enough savings cushion to get us through the worst health crisis of our lives (we hope).  \n  And that is the correct priority to keep in mind when planning your wedding.  \n  It Was Not the Best Day of Our Lives  \n  Look, I get it. Any overhyped event can make you anxious enough to turn into a ‘zilla of some kind — I’ve known Prom-zillas, Christmas-zillas and even a Bris-zilla. You must resist the hype and focus on the fact that no matter how beautiful an event it is, it’s Just. One. Day.  \n  I don’t know if I speak for every wife when I say this, but honestly, when I look back on my wedding pictures, the main emotion I feel is incredulous — that my husband and I had no idea of the challenges we were facing, that we barely knew each other, that I wish I had professional portraits that weren’t so obviously bridal shots and oh my God, my dress was more low-cut than I realized.  \n  It was not the best day of our lives. It was an amazing party and probably the best day of our lives up till then, but we’ve had days since that blew that one out of the water. And some of them didn’t cost nothin’.   \n  A Wedding Costs a House Down Payment  \n  Enough preaching. These are the numbers. According to CostOfWedding.com, which is produced by a market-research company collecting information for the wedding industry, the average wedding in the U.S. costs about $25,631, possibly more depending on where you live (here in the Bay Area, it goes up to more than $40,000). That is a down payment on a very nice house here — or the whole house, in large swaths of the country — and an amount many claim they just can’t manage to save up.  \n  So ask yourself: You want to take that amount and blow it on a one-day party, or you want to use it to create an investment that’ll end up paying your kids’ tuition if you play it right? And if your answer is the former, holy crap. Are you bipolar?  \n  The website goes on to list all the expenses you should take into account when planning a wedding. Things like gifts for the parents, wedding favors, a “traditional leather bound album” for the photos, flower-girl petals. According to the Association of Wedding Professionals, the wedding industry nets about $86 billion per year. That’s billion with a B.  \n  That is a lot of people counting on you getting starry-eyed about your wedding. Just like Las Vegas counts on chumps who think they’re going to beat the craps table, and the tobacco industry counts on weak-willed copycats who feel rebellious when they emulate Courtney Love.  \n  It’s an industry. It wants your money. Don’t give in to it. This idea that you deserve a wedding is not the point; of course you deserve a wonderful day. But what you deserve even more is financial security and a debt-free future. So plan a wedding based in reality, and who you are and what kind of wife you want to be: supportive, smart and with two feet firmly in reality.  \n  You’re not a princess, princess. You’re a smart cookie. Trust me, that’s so much better."
			}
		],

		"marriage":[
			{
				"type": "post",
				"title": "Incest, Inbreeding and Incestuous Marriages should all be legal",
				"text": "It takes generations for inbreeding to create a serious increased threat of genetic diseases, And if both partners are capable of consent i don't see why they shouldn't be allowed to have sex."

			},
			{
				"type": "post",
				"title": "Extra-marital affairs should be accepted by society",
				"text": "Sex is a fundamental human need. And for most marriages, when a woman is past the age of 35, her body and face's natural degradation, along with the toils of daily life, especially with kids, make her sexually unattractive. This is compounded by the fact that the husband has been too familiar with her body as to experience diminished marginal returns on sexual desire with her. Think about it, say you love Hamburgers, but if I feed you the same hamburger every day for 30 years, most of you will get tired of it. Put it in another way, no matter how hot you find a woman, you can be sure there's someone out there who is tired of fucking her. The above is no one's fault, it's just natural for men to desire and conquer multiple females, especially conquering other married females. This does not mean the man no longer loves his wife - he can go and fuck a new woman every week, and yet still provides for his family, spend his time with his wife and kids on the weekend watching tv, reading books, eating pizza, attending soccer games. He can still be emotionally available for the wife, and even fuck her to satisfy her needs. In other words, as long as his sexual adventures outside of marriage do not impact his ability to be a good husband, then that should be not be a problem. Why does 'body-unfaithfulness' have to mean 'mind-unfaithfulness'? In fact, I'd argue that 'mind-unfaithfulness' is even more dangerous - a man who never have sex with another woman but no longer feels any love for his wife. For full disclosure, I have, at any time, 3-4 sexual partners outside marriage, and most of those are also married (high school/college teachers, magazine editors, fashion designers, HR people, etc). They are all good wives with happy families but just looking to satisfy their natural biological needs. And likewise, I'm a loving husband and responsible father and both my kids and my wife love me. A plug is designed to plug into any compatible outlet."
			},
			{
				"type": "post",
				"title": "Only parents should have legal rights to marry.",
				"text": "Before any of you call me out, I'm talking about a legal marriage. Not religious one or spiritual interpersonal one. I don't see the point of a legal union of childless couples. The state should not be involved in this. It should however intervene when there are children that need to be raised. Here, the existing support should stay as it's necessary when there's a underage person involved."
			},
			{
				"type": "post",
				"title": "Only gay people should get married",
				"text": "Traditional marriage was a hedge: Women could not work and were therefore worthless past their childbearing years, 35+. Marriage was a hedge - a protection against a man leaving a woman when she got older, so the man couldn't leave her poor and helpless. Nowadays that women can work any job a man can and earn her own way, heterosexual marriage is pointless, at best (and detrimental in some ways). The only people who really value marriage are those whom it was traditionally denied to, homosexuals. My view is this: Heterosexual marriage is outdated, pointless, and detrimental. The only people who should get married are those who feel like they have something to prove, which is homosexuals presently."
			},
			{
				"type": "post",
				"title": "No man should ever fucking get married",
				"text": "What's the point? It's just meaningless symbolism and there are far more cons than pros. It's far more benefiting to women. It's essentially her retirement plan. I heard some drunk whore talking about how her man has millions of dollars and how she is going to get a million in alimony once it's over. And she's right, she will. Pay some bitch half of what you make . Nah fam, not me. Seriously , what's the point? Especially if you aren't religious , which most of you simps getting married aren't. I can do everything you can, minus the bullshit. Add in the fact that she will probably suck the dick of the manager of the pita pit in the bathroom while out with you and the kids and then kiss you afterwards ,and then going to see her lawyer while she is 'out with friends' to finalize the divorce papers, i see no upside. There is nothing beautiful about forcing yourself to spend your entire life with someone out of obligation. Nothing is permanent . Enjoy it while it's fun, and then move on. Everything shall pass."
			},		
			{
				"type": "post",
				"title": "Extremely attractive women are promiscuous, deceitful and cannot be trusted in a marriage.",
				"text": "This whole persona of an extremely beautiful, yet modest and humble woman is such a Hollywood illusion. In modern real life a woman who knows they hold such a power of beauty over men are master manipulators and will exploit their looks to their own advantage. I´m not saying they are bad people, humans are naturally selfish creatures and they are just being human. But if you are looking for loyalty, marry some ugly chick or stay single and save yourself the heartache. I know many will disagree with this statement, as I would have in the past. But one day the spell will be broken and you will realize that life is not a romantic comedy. Trust me."
			},
			{
				"type": "post",
				"title": "There is nothing wrong with marrying for wealth or status.",
				"text": "Marriage for love is a relatively modern idea in the Western world. Not very long ago, it was not uncommon for families to arrange marriages based on connections, education, social status, or who they thought would be the best provider for their daughters. Marriage was often like a business contract where families would join together and share certain benefits. Sure, a lot of things have changed, and we also no longer treat women like property or own slaves, etc. So naturally in a first world country where we all have the ability to live independently and earn money, it makes sense that marriage would only take place for reasons of being in love and wanting to spend life together. With that in mind, love is fickle and emotions come and go. Maintaining a healthy relationship takes commitment even when the times are tough and the love feels like it is draining. People change and go through difficult times. While people divorce for numerous reasons, financial reasons are often listed very high up as a big stressor in a marriage. People are always seeking security and while money can't buy happiness, there is little you can do with poverty, limited mobility, and a partner who squanders money and runs you into dept. People that marry for money may seem cold and unloving, but I believe they are being very practical. It's a fair transaction. They offer their partner companionship, sex, love - even if forced, family, and other potentially positive traits such as beauty, etc. and their partners, in return, provide them with security, a nice home, and a respectable place in the community. Since the 'golddigger' is not marrying for passion, they are more likely to make things work in a rational way and may actually be a better partner since they do not let their emotions rule them. In conclusion, I don't believe this situation works for everyone or that people should espouse this as an ideal. However, I see nothing wrong with people who choose to go this route and can understand why they would."
			},
			{
				"type": "post",
				"title": "The couple should come first, not the kids.",
				"text": "I cringe every time I hear a parent say 'my kids come first'. I mean, of course a parent should make sure to meet their kids basic needs. But when a couple sacrifices any kind of date nights or romance in order to put all the focus on the kids, they better not be surprised when their marriage falls apart. I mean, after the kids are grown and moved out, you won't have a marriage left if you put it on the back burner."
			},
			{
				"type": "post",
				"title": "Marriage is a scam",
				"text": "I think getting married, getting babies, and living happily ever after is an absurd goal. Marriage is a religious scam. It's an overrated thing."
			},
			{
				"type": "post",
				"title": "I think divorce outside very limited circumstances is wrong",
				"text": "Except in cases where there is genuine abuse (and I'm not talking about mild emotional 'abuse' that can occur in all relationships from time to time and is solvable by talking) I think its morally wrong to divorce, especially where children are involved. Some people say 'its better for the children not to see their parents fight' - but what would be even better is to see their parents work through it and not throw each other away as soon as they hit serious difficulties. What about adultery - I think adultery is seriously wrong, I think it should be grounds for divorce, but I still think its wrong to divorce in that case, plenty of people have worked through it and come out stronger the other side. When you marry someone you make them family. Family members don't abandon each other, they don't run away just because of conflict, they don't decide they're tired of one another because they don't feel excited any more. Family is composed of people you have an indissoluble bond to, either blood or marriage, and it's only because of the security of that indissolubility that it can fulfill it's function. When people treat spouses like consumer goods that can be bought and sold, traded in, thrown away according to whether or not right this instant they are making them 'happy' they lose the nature of the spousal relationship and the security it provides and the function that plays in the development and transmission of human culture. When you degrade marriage you're degrading society as a whole. Even in cases of abuse divorce is a terrible tragedy, but it's the abuser that broke the security in that case by abusing their spouse. Even then the ideal would be for the abuser to reform and the relationship to survive, but I recognize real life is often far from ideal."
			},
			{
				"type": "post",
				"title": "People get married because they don't love each other",
				"text": "People don't know what love is. That's why they get married and the guy buys an expensive ring and they have a fancy wedding and take pictures to post on social media and all that. All the theatrics are just cover up the lack of love between them. Love implies freedom. Giving the other person freedom to do and be whatever they want, but marriage restricts people to the point where they have to pretend they still love each other. If you get married and then stop finding your wife or husband attractive or whatever (which usually happens) you then have to pretend because that's supposedly better than getting a divorce, which is silly. That's why most couples have children, so that they can focus their attention on the child and not on their crumbling relationship. A lot of people will disagree, mainly because they are married or they plan on getting married in the future. But if you are really honest with yourself and if you observe other married people's relationship (maybe your parents'), you might realize that i'm not wrong. Real love is really rare in our society and if that kind of love was more common, this planet would be a paradise and there would be no need for marriage at all because it is unnecessary. And with no marriage, there would be no divorce."
			},
			{
				"type": "post",
				"title": "My current peeve: women changing names.",
				"text": "Lately so many people around me have been getting married and divorced. And with it comes all the work they put on everyone around them to deal with their name change. 'Teehee, I'm signing all my emails Firstname (formerly Maidenname) MARRIEDNAME!!’ And all the stupid commentary...'it's so weird that my name disappeared!' No it didn't, ho, when you get divorced it's still there and you'll be filling out paperwork using it for the rest of your life one way or the other. 'It's so annoying to apply to things now that I have to have so much extra paperwork to prove my name change!' No sympathy from me; that's just the penalty you pay for being self-obsessed in my opinion. I get it - in our society, women wind up with men's names one way or another. You get your dad's name, then swap it out for a husband's name. But I prefer simplicity and individuality, and all the people changing their names all the time makes everything a headache for everyone around them. No one gives a fuck that you got married or divorced. It's a little rude to make everyone around you relearn your name every time your relationship status changes. It seems like you're way too desperate for attention. Also, it just seems sad. You don't get to be an individual person anymore - having some dude's name put on you just feels like being marked as territory. It's gross. I can't help it, but I automatically lose respect for every woman I know who changes her name. I feel a bit like a bad feminist - it's her name and she can do what she wants with it - but name changes just gross me out so much that I can't help it. I deal with it by just ignoring name changes. Oh, I'll use the new name or whatever, but I don't remark on it and I don't bat an eye. You wanted attention? Sorry, but you'll have to find someone else to ooh and coo over your annoying feat of paperwork.Rant over."
			},
			{
				"type": "post",
				"title": "Reason #376 to not get married: Your spouse can't kill you!",
				"text": "Every time I watch Dateline MSNBC I'm reminded that whenever someone is murdered the prime suspect is the spouse... And often the husband/wife really did do it. (For those not familiar Dateline is a show about real past murders and the court proceedings that occurred afterward) The couples are always attractive and the interviewed family members always remember how 'perfect ' they seemed from the outside. It never fails that in reality the marriage was in a shambles, one or both had been cheating for years, there was abuse, etc. So cheers everyone, to NOT getting killed by your spouse"
			},
			{
				"type": "post",
				"title": "Yes, my husband took my last name. There’s nothing wrong with it.",
				"text": "When two of my classmates heard me mention this morning that the guy I'm married to took my last name, they thought it was the funniest thing they'd ever heard of, and spent ten minutes cackling like hyenas. I wish I could say that's an unusual response, but I am freaking sick of the little snickers I hear from people when it comes up in conversation. Some things I've heard from these two just this morning: 'So who wears the pants?' We both do, obviously, unless I'm in a skirt or dress mood 'Why did you make him do that?' I don't make my partner do anything. He asked me… 'Why didn't you want his name?' Because I didn't. Apparently he didn't either. 'Well the girl I marry is going to take my name' Well, one day you'll maybe find a girl who can put up with your attitude, steal her heart, date her for years, convince her to marry you and take your name............and I still won't give a fuck about you or your marriage 'Does that make him your wife?!?' No, it makes him my partner who cares about my values and how I feel on certain things. There is a reason we use the word 'partner' instead of ‘husband/wife' 'That's really freaking weird' So is your sudden obsession with my life For crying out loud, mind your own fucking business."
			},
			{
				"type": "quote",
				"title": "Marriage is for everyone; it's just that people either marry the wrong person, are too selfish or unstable to be in a marriage",
				"text": ""
			},
			{
				"type": "quote",
				"title": "I just don't want to get married period. Never saw a problem with living in sin for the rest of my life.",
				"text": ""
			},
			{
				"type": "article",
				"title": "Marriage Will Never Be A Feminist Choice",
				"text": "A new study conducted by Facebook shows that younger women are opting not to take their husbands’ names in marriage. The statistics, which show that a third of all married women in their twenties chose to keep their own names, whereas only 12 percent of women in their 60s decided not to take their husbands’ name, have been hailed by some as a sign that younger women are 'embracing feminism.’  \n  While I certainly support women who push back against this tradition, my elation with regard to this development is muted. Maybe fewer women are doing it, but many continue to take their husband’s name in marriage despite the fact that it’s no longer required. That women continue to do this voluntarily tells me that our concept of 'romance' and commitment are still firmly rooted in inequality.  \n  There are no persuasive arguments to defend the practice of taking on your husband's name in marriage. You just like the idea? Fine. Say what you mean –- your idea of romance is tied to symbols of submission. In many ways, we’re all susceptible to that. Hey, I made my first boyfriend buy me the tiniest diamond ring you could find (twice, in fact, as the first was lost in a tragic toilet-flushing accident) because I had internalized the silly notion that diamonds were connected to love and romance despite the ethical implications of diamonds. Say what you mean, and then question it.  \n  And to those who say it's 'less confusing' for the kids? Kids are not quite as dumb as you make them out to be. My mother kept her maiden name and somehow I managed to understand that she was my mom. Family pressuring you to follow tradition? Fine. I hear that. It’s hard to fight deeply ingrained family traditions. But that’s still about patriarchy.  \n  To me the name change issue is a moot point. It’s about patriarchy. Period. Just because we can make a choice about whether or not we want to buy into it doesn’t remove that reality.  \n  But I want to move beyond that conversation. To me the real question is: Why marry at all?  \n  Never in my life have I been interested in getting married. I’m interested in love, commitment, long-term relationships, and the sharing of dogs and groceries. What marriage has to do with any of that is lost on me.  \n  When I was younger and decidedly uncommitted, engaged in a series of one-night stands and regular booty calls and told people I didn't want to marry, they assumed it was because I was committed to singledom –- that I just wanted the freedom to fuck around for life. I was told I’d change my mind once I fell in love.  \n  But I did fall in love. A bunch of times. And still I found myself unable to find a convincing argument for marriage. 'Security,' said my mother. Security? But people cheat all the time. And 40% of marriages end in divorce, which strikes me as a particularly costly, time consuming, and exhausting way to break up. Break ups are almost always horrible, do I have to add lawyer fees to that?  \n  Marriage doesn’t guarantee your partner will with treat you with love, kindness, or respect for life. It doesn’t guarantee you safety, nor does it ensure your partner will support you or help with housework or childcare (in fact, marriage has long guaranteed pretty much the opposite). Marriage has been an institution within which women have suffered abuse, rape, murder and forced reproduction. It’s an institution that guaranteed men a maid and someone to bear and raise their offspring.  \n  The legal arguments don’t pan out for me either. In Canada, at least, being in a common law partnership guarantees couples the same rights and privileges marrieds are entitled to. It seems more productive and more progressive to fight for common law rights than it does to fight for an old, tired, regressive, and unnecessary institution such as marriage. What exactly are we trying to hang on to?  \n  I hadn't realized my anti-marriage position was such an abnormal thing until I hit my thirties and everyone around me started getting married. It seemed almost automatic, like an alarm went off: 'It’s time! It’s time! It’s time!' It was as though people didn’t even think about it –- marriage was just the 'natural' next step.  \n  It became apparent that, for most, marriage was an assumed part of their future so I started having the conversation with potential partners early on.  \n 'Just so you know, I don't want to get married or have babies,' I'd warn my dates over drinks.  \n 'Ever?' they'd ask, confused.  \n 'Well, no. Not ever. Unless you, like, need citizenship or something equally practical.' \n  I’ve explained dozens of times over: 'Yes, I want a monogamous, love-type relationship. No, I don't see what marriage has to do with any of that.' The assumption that I simply didn’t want to commit confused me. 'I'd love a life partner, this is a political decision,' I’d clarify. I don't think it's a stretch to say that, for most men I've dated, I was the first woman they’d ever heard such a thing from.  \n  Women, in particular, are taught that a marriage proposal is something that validates them. It means they are desired -– that a man wants to 'lock it down.' And yes, I understand how a proposal could make one feel loved. And of course we all want to be loved. But is it so difficult to imagine that love can exist without diamonds and white dresses and an institution that made women into chattel? Things to be traded among men? Is it so difficult to imagine that people might commit to and love one another, just the same, without that piece of paper?  \n  It seems that if women were truly 'embracing feminism,' they’d reject such an unnecessary tradition so firmly rooted in sexist practices and ideas. While you can’t guarantee commitment or 'till death do us part,' you can guarantee is that marriage, over time, has harmed women more than it’s helped them. Rejecting marriage seems not only a political choice, but a practical one. And hey, you can still have a party."
			}
		],

		"romance": [
			{
				"type": "post",
				"title": "I like watching public display of affection.",
				"text": "Ok, I know that might sound a bit creepy, but it's not like I actively search out couples who kiss in public to stare at them. I just think seeing two people who love each other is really, really sweet. To me, it's a confirmation that love is real, and that makes me happy. Maybe I'm just a hopeless romantic, but that's the way it is!"
			},
			{
				"type": "post", 
				"title": "It's weird dating someone you met in irl rather than online",
				"text" : "I went on a first date with the guy from work I talked about recently. It was a different kind of date. Idk. it felt weird. well, I guess he liked me because we are seeing a movie on Sunday, but ya, it's weird to date someone from rl."
			},
			{
				"type": "post",
				"title": "romance isnt true and relationships are simply a pact of alliance.",
				"text": "what can you bring to the table? will this person make me happier? see, all relationships boil down to is a way to make yourself happier. no one is irreplaceable. there is no 'special bond' between people. that's why divorces are so common. all relationships are is just a pact of alliance to benefit yourself. no two people actually genuinely care about each other without something material to gain from each other. everyone wants something out of it, whether it be good looks or able to drive a car etc. if you still think romance is genuine after 14 then you are deluded and need to get past all the disney shit that you have been brainwashed with as a child. relationships are solely material, end of story."
			},
			{
				"type": "post",
				"title": "Love does not exist, and that is a FACT",
				"text": "The emotion of 'love' as many people simply does not exist - it is not something humans can feel. Yes, you can LIKE something. But you can't 'love' something. What you mean is that you like something a lot. You love someone? No, you just like them more than somebody else. You love food? You just like food. You do not 'love' it. Love is a false emotion that does not exist. What you mean is that you like something. And then, 'love' as in 'fall in love' is a bunch of bullshit - you will not magically like someone and be infatuated with them. You'll just be obsessed with them, like a creep. 'Love' in that sense is just two creepy people who are obsessed with things easily obsessed with each other. 'Love' is just a thing idiots say to feel good. Of course your SO makes you feel happy, but so do your friends except the only difference is that you're not fucking them. Do you 'love' your friends, too, in that way? No, of course not - you like them, in the exact same way you like your SO. You just see your SO more often. 'Love' does not exist, and this is not only my unpopular opinion but a much needed PSA for the world. You're better off feeling hatred for those you hate. That will actually accomplish things - spite is a much better motivator than love is."
			},
			{
				"type": "post",
				"title": "Love is worthless to us",
				"text": "We spend so much effort wanting to be loved, trying to seek it out and crying like little babies when we feel unloved. That needs to stop. We could make so much more progress in our meaningless lives and in this world by getting a fucking grip and putting this childish desire for love behind us and moving forward. I think it all starts at a young age. Too much coddling for kids when we should be real with them. We should be logical with kids and stop this bullshit we feed them."
			},
			{
				"type": "post",
				"title": "Cheap Fast Food is great for first dates",
				"text": "The problem with the first dates that I read about is that I feel like too many men try to IMPRESS women on the first date by having well planned and overly thought out evening. Some mechanical and robotic evening like 'we start at point A, go to point B, then point C, and then I drop you home'. Those nights are not fluid. IMO, you've already lost when you're spending a lot of money on a date, and you've also lost when you put in a lot of effort trying to impress someone that you do not know. She's enjoying the free ride that you're paying for, and gives you a hug at the end of the date for being a good boy who worked so hard to impress her .... while not even knowing what she is really bringing to the table besides (possibly) good looks. If somebody rejects your Cheap date/hangout request, you probably don't want to be with them. They may be materialistic. Stop trying to impress people. Stop wasting money on expensive first dates with strangers. And this thread has nothing to do with money. You can be well-off, and I would still suggest a cheap date idea where you are not potentially being used for your resources. (free dinner for her on your bill, that she'll brag/laugh to her friends about)."
			},
			{
				"type": "post",
				"title": "Men are more romantic than women",
				"text": "It was a man who came up with the concept of platonic love. The greatest works of romance fiction have all been written by men. Meanwhile women's most famous contribution to the genre is 50 shades of grey, a book that glorifies rape and abuse under the guise of romance."
			},
			{
				"type": "quote",
				"title": "The idea of going out on a date with any real person makes me feel like boiling water has been poured into my stomach.",
				"text": ""
			},
			{
				"type": "quote", 
				"title": "Men's cologne 90% of the time smells better then women's perfume.",
				"text": ""
 
			},
			{
				"type": "quote", 
				"title": "I find hugs more romantic than kisses",
				"text": ""
 
			},
			
			{
				"type": "quote", 
				"title": "4th of july is a more romantic holiday than valentine's day",
				"text": ""
 
			},
			{
				"type": "article",
				"title": "Ignore the Movies: 'Romantic' Gestures Are Creepy",
				"text": "I’ll often groan when a movie uses a sweeping romantic gesture to nudge the plot along to its natural conclusion. The guy does something wildly over-the-top and ludicrously romantic to win over the girl’s heart and, consequently, our two always-outta-luck characters get together. The next and final scene shows them as happy as an eHarmony ad: they’re playing ball on a deserted beach with a friendly-looking Golden Retriever, or walking down the aisle as confetti’s thrown on them by less attractive-looking friends (the comic relief).  \n  The subliminal message here is: do something crazily romantic and you’ll seal the deal. According to these movies the bigger the gesture, the better! The more insane the gesture, the more lovable you are! The shorter the amount of time you’ve known her, the more romantic!  \n  In 'Love Actually,' Colin Firth catches his girlfriend in bed with his brother. He flies to France and quickly falls for a Portuguese housekeeper. Neither of them speaks the other’s native tongue (although they do share a thrilling moment of saving typewritten pages from blowing into a lake), so their first conversation is when he arrives unannounced in her hometown with a rudimentary grasp of Portuguese. Rather than covering some getting-to-know-you basics ('So you’re a housekeeper … did you have to go to college for that?'), he goes in for The Big Proposal. Beautiful, right?  \n  Not really.  \n  Let’s rewind to the moment when Colin finds his girlfriend in bed with his brother. His speedy proposal to someone else shrieks rebound in neon flashing lights.  \n  I don’t think men are lining up to watch 'Love Actually' or other romantic movies with similarly bizarre moments (you can strike The Notebook from your Netflix queue as well), but perhaps through a process of detached osmosis (e.g., it was playing in the background as you helped Mom carve the turkey, or an ex knew all the lines by heart and quoted them at inappropriate moments, etc.), men may have picked up on the misleading message embedded in these movies: that women want romance -- lots of it, and the sooner the better.  \n  A couple of years ago I found myself embroiled in an intense relationship by the middle of our second date. He complimented my outfit, my hair, my smile and the softness of my skin. I shifted uneasily. Did I not like compliments, he asked? I explained it was too much too soon, that it felt like he was falling in love. His response was an unequivocal: 'But I am falling in love with you' -- met by stunned silence. The following week he asked me to meet his mother. I panicked and said no. Unsurprisingly our relationship never reached the one-month mark.  \n  Another time I was standing on a train platform with a friend when it began to rain. I didn’t have an umbrella so we shared his. Huddled beneath it, waiting for the train, we talked and drew closer and closer until we were kissing. The next day the receptionist called to say a man had stopped by the office with an umbrella for me. It was lovely, very old-fashioned, very 'Brief Encounter' (without the affair part). I wanted to adore the gesture, but combined with a frenzy of excited emails and texts, it felt intense and I found myself backpedaling.  \n  The umbrella part was sweet though, right? So maybe I’m the one with the problem?  \n  I checked with friends and they’ve been through similar experiences. They agree that, early on, signs of devotion aren’t good -- they’re off-putting. One friend was enjoying a pleasant second date until the guy declared he just knew they’d get married one day. She laughed it off nervously. Each time they met he continued to mention their pending marriage, until the day she ended it.  \n  Another friend was on a seemingly great first date. They loved the same movies! They had the same sense of humor! But after two hours, his enthusiastic crows of agreement felt forced. Everything she said he agreed with. Every joke she cracked was hilarious. She felt he was trying too hard to prove they were instantly compatible. It had the opposite effect: Man this one’s laying it on thick.  \n  There are two reasons why women don’t swoon instantly when greeted by an overload of ardent feelings or romance.  \n  The first is about balance. There are opposing roles in every relationship; this applies not only to marriage or romantic relationships, but to roommates, siblings or friends. The roles are fluid and they switch depending on the task in hand, but tend to go like this: One person is more detail-oriented and sensible, they figure out what time the movie starts and which train gets them back into the city in time for brunch with relatives, while the other adopts the role of being more impetuous and fun.  \n  During those first few dates, the same principles apply. If one person comes on too strong too quickly, the other tends to take a step back and slow down. While the boy was busy telling me he loved me on our second date, I was thinking, I’m still figuring out if I even like you -- how can I POSSIBLY catch up to the level of feeling you already have for me?? It was a huge amount of pressure. I couldn’t get to where he was fast enough. I couldn’t see the scales balancing out, which meant they never did.  \n  The second reason we don’t like it is plain cynicism. Some people just love to fall in love. The serial monogamist transitions from one relationship to the next. He wants to ignore dates two to 12 and get to that really cozy stage where his friends merge with hers and where he finishes the anecdote she begins and she polishes off the crème brûlée he ordered. It’s what my friend sensed on her first date. And while it’s lovely that he likes to be tactile and couple-y and include his new girlfriend in everything, often it transpires that he loves having a partner, rather than loves his specific partner.  \n  Women sense when they’re filling the gaping void left in a man’s life by his ex-girlfriend or ex-fiancée or ex-wife. It’s what Colin Firth was attempting with his microwave-speed proposal. It’s not us you’re falling for when we’ve only been on one or two dates. It’s the idea of us. And that leaves us feeling cold.  \n  Don’t get me wrong, women love romantic and considerate and kind. We’ll choose these qualities over a Neanderthal any day. But we want it when there’s a genuine connection. Timing is everything and if you’re saying those three little words within a handful of dates then it’s not romantic. It’s creepy.  \n  So is it too much to ask that during our first few weeks we sweep romance to one side and simply act like two people who are enjoying their first few weeks of dating? In that initial period we’re not cute or compatible or in love or perfect for each other. We’re just figuring it out. And there’s no rush."
			}

		],

		"sex" : [
			{
				"type": "post",
				"title": "I'll kinkshame till the cows come home",
				"text": "I largely don't care what your into but there is stuff that is fucked (incest, beastality, gore, rape), and if you get enjoyment out of those fucked things your probably fucked yourself, or you just don't have standards. I don't care if this posts gets down voted or I get pm's asking me to eat a dick, people need to have some standards and self respect."
			},
			{
				"type": "post",
				"title": "Sex should be illegal", 
				"text": "Some people can get more sex than others and that it unfair. We should make everyone equal by outlawing sex and masturbation. Sure there's hookers for ugly men, but it's not the same since you still aren't sexually desirable and there is no woman who ACTUALLY wants to fuck you, so you are pathetic to the point that you can only get laid by paying for it."
			},
			{
				"type": "post",
				"title": "Abstinence is am old biblical concept that should be thrown away.",
				"text": "In ancient times, priests realized that women going around getting knocked up by 15 men and then the men/woman abandoning their children caused some serious issues regarding the survival of a community. As a result, a section of the Bible said that 'God doesn't like it when you have sex before marriage.' Now, in modern times, we have condoms, contraceptives, plan B and even abortions, all to prevent unwanted pregnancies, so why should abstinence exist and prevent teens who are restricted by their religious parents' upbringing to not gather experience in that field during their youth?"
			},
			{
				"type": "post",
				"title": "I think it's OK for married men to pay for sex",
				"text": "I personally don't see a problem with it. As long as a man is careful about sexual diseases, regards his personal safety, has the disposable income for it and still fulfills all of his wife's sexual and intimate needs. I think unlike women men crave variety. It's biologically ingrained into them. I think asking a man not to crave variety is like asking a woman not to want a baby. It goes against human nature. I also think that prostitutes are there to do what wives and girlfriends often won't do. You can always find a prostitute that will take it up the backdoor, whereas if my husband requested that from me it would always be a flat out no. Many men have fetishes and kinks that their wives are just not happy with and seeing a prostitute fulfills that need. Many women don't want to have sex often any more and I think declining your husband or wife sex is cruel. That's a different issue all together and I think in this situation someone really needs to take a look at their marriage, prostitutes are often not a fix for not getting love from your wife. I would just like to point out I also think that sex workers are not just sex objects but human beings, and they deserve respect and have their own rights and everything they do should always be consensual. I think men who abuse sex workers are bad people, full stop. They still deserve respect. I think sex work should be fully legalized and made safer."
			},
			{
				"type": "post",
				"title": "I'm disgusted by both men and women who sleep around",
				"text": "I would never go as far as to forbid people from having sex with whoever they want. It's just that I have a lot of friends who find it easy to sleep with multiple people, and, honestly, whenever I listen to their bragging, I secretly feel kinda squeamish inside. I'm a straight woman, but I don't find men who sleep around attractive, even if they're super handsome and confident. No, I'm not asexual, and no, I'm not unattractive nor a virgin. I just honestly can't do sex without deep feelings and I expect similar mindset from my partners."
			},
			{
				"type": "post",
				"title": "Im OK with people asking for sex",
				"text": "OK. So I'm female, I would rather men just straight up tell me. If they don't tell me what they want and all they wanted to fuck its annoying that they should pretend they wanted a relationship. However, that being said, its creepy when people can't take a no. That's when it gets creepy."
			},
			{
				"type": "OK. So I'm female, I would rather men just straight up tell me. If they don't tell me what they want and all they wanted to fuck its annoying that they should pretend they wanted a relationship. However, that being said, its creepy when people can't take a no. That's when it gets creepy.",
				"title": "Sex is disgusting and there's nothing wrong with not wanting it.",
				"text": "If you like sex, then have at it, enjoy yourself. I realize that to many people sex is a very important, life-changing thing, but I find it not only overrated, but also repulsive and nasty. Just the thought of having sex makes me want to vomit. I'm not afraid of it but I find it disgusting. There's also nothing wrong with not wanting to have sex. It's not mandatory and it's not mentally ill to not want to have sex. Yes, people are animals, but we as evolved human beings can make our own choices on the matter. To me there's no reason why sex is necessary. It's easy to still make meaningful connections to other people without sex, and adoption is an option if I ever wanted children."
			},
			{
				"type": "post",
				"title": "Very few people, if anybody, enjoys one night stands.",
				"text": "Before I get comments from people saying I'm just a jealous virgin - I've slept with over 20 women. Many of them have been one night stands. I'm saying this based on the experiences I’ve had and the conversations I've had with both men and women regarding the topic. My conclusion is that most people don't actually enjoy having one night stands, but we feel pressured to due to the culture and media we're raised on. Hence why so many of us, both men and women, have to be intoxicated in one way or another to do it. Girls feel pressured because they're 'sexuality liberated' now, so are obliged to enjoy it. Guys feel pressured because they have to prove themselves as the alpha. I've never had a one night stand that has even come close to how joyous sex is when it's someone you properly know, trust, and have chemistry with. (EG: A girlfriend or someone you've been on multiple dates with first) You wouldn't tell someone you barely know the deepest, darkest secret about yourself, would you? Being naked and having sex with someone is completely exposing yourself in a slightly different manner. I believe most people don't enjoy it, they just feel pressured to. So to anyone feeling inadequate for not sleeping around; don't. I have no regrets, because they've each lead me to this conclusion. But honestly if you never have then you're not missing anything."
			},
			{
				"type": "post",
				"title": "Pre-marital sex ruins relationships",
				"text": "there are always exceptions, of course, but this is something no one wants to say because everyone likes sex, but hear me out. sex is fun. no matter who it's with, it is enjoyable. The problem is that people confuse sex with love. A lot of couples stay together even though they fight and bicker all the time, because the sex is good. Unfortunately, sex is ALWAYS good. Like pizza. Even the worst pizza is still a good pizza. So the whole 'try-before-you-buy' thing is just bullshit. Just because you are compatible in the bedroom doesn't mean you'll be compatible in your relationship."
			},
			{
				"type": "post",
				"title": "There is nothing wrong with teenagers having sex.",
				"text": "As long as: 1. They are sexually mature. 2. They know what they are doing. 3. They want to do it. 4. They are not being pressured or taking advantage of. 5. They are using protection for STD's and are using effective birth control. 6. They are doing it with someone around the same age as them. 7. They are not using sex to validate themselves in a area of their life that they feel lacking. 14/15/16/17 year olds want to have sex, and that's OK. It feels good, relieves stress, and no one is getting hurt. Virginity isn't a 'scared innocence'. It just means you haven't done a physical thing that every person on the planet wants to do."
			},
			{
				"type": "post",
				"title": "There's nothing wrong with masturbating to Facebook photos",
				"text": "If you are going to post pretty photos of yourself then I am sure as hell going to pull my trousers down and pleasure myself to them. If you don't want me to do that then take the pretty photos of you and your friends down."
			},
			{
				"type": "post",
				"title": "Threesomes are really about straight people exploring bi sexual fantasies",
				"text": "If your 2 guys fucking a girl you both are bi. You are tasting another guy when you kiss her. You are rubbing the back of your cocks together when you dp her vagina. You are 2 men naked together. If you are 2 girls fucking a guy you both are bi. You are tasting another woman when you suck his cock or when you kiss him. You are down on your knees naked with another women and both of you are licking and kissing the same cock getting your saliva in each other’s mouths. And don’t get me fucking started on cum swapping!"
			},
			{
				"type": "post",
				"title": "I highly dislike 'making out.'",
				"text": "I'm all for passion, but it can be a little much and overly done for me the majority of the time. I was told i 'kissed like a middle schooler' by a man one time when I was trying to tone it down. The most passionate kisses for me are slow and light."
			},
			{
				"type": "post",
				"title": "If you have consensual sex before marriage, you're a slut",
				"text": "Obvious exception in the case of rape or assault, of course. Girls nowadays are just spreading their legs when they're teenagers, and we, as a society, have apparently decided that this is okay. No man honestly wants to spend their lives with 'used goods'. It's pitiful and shameful that we don't condemn these kinds of actions more"
			},
			{
				"type": "quote",
				"title": "Having sex should only be for procreation.",
				"text": ""
			},
			{
				"type": "quote",
				"title": "I have come to the decision that except for the creation of my daughter, sex is pointless and stupid",
				"text": ""
			},
			{
				"type": "quote",
				"title": "I would rather be punched in the face than go through sexual contact.   ",
				"text": ""
			},		
			{
				"type": "article",
				"title": "Christian Kids Should Save Kissing (and other things) for Marriage.",
				"text": "The sad reality of many Christian kids is that for the most part, they pick up what they know the same way they pick up the common cold: casual contact. Christian parents are notorious for avoiding the subject of sex, in general, and what’s appropriate physical behavior for Christian young people, in particular.  \n Are you uncomfortable talking with your kids about their natural (God-given!) interest in sexuality? Get comfortable. Ask God to help you get over it because you are the primary source from whom God intended your children to learn what they need to know.  \n Before trying to answer the question of what is appropriate, there is another question that is more fundamental to this conversation. There’s something we need to settle first.  \n Are we going to be biblical Christians, or are we going to consult our own reasoning and feelings first, extrapolating from them what we should teach our children?  \n If we are to be biblical Christians we must conform our lives to what the Bible says, regardless of where our feelings and human reasoning would take us.  \n Does God require faithfulness and purity in marriage? It’s not that complicated. We don’t need to scratch our heads trying to discern whether or not God wants us kissing someone else’s husband or wife. Marriage is sacred and it is, according to the Bible, between a husband and wife.  \n There’s a special word for people who kiss (or even fantasize about kissing) someone else’s spouse: Adulterer.  \n No, God’s not in favor of that. Remember The Big 10 – the Ten Commandments?  \n You Shall Not Commit Adultery Exodus 20:14  \n When speaking with Christian singles, I like to ask this question. The response is always the same . . . Are you serious? Of course that’s wrong! That’s being unfaithful to your spouse.  \n  And, that’s my cue for Question #2 . . .  \n If it is wrong to kiss someone else’s spouse, is it okay to kiss someone else’s spouse before they are married?  \n God would have His children be faithful to their spouses all the days of their lives. Not just after they get married. This exact statement is made in Proverbs 31:11, 12 The heart of her husband safely trusts in her, and he will have no lack of gain. She does him good, and not harm, all the days of her life.  \n  All the days . . . not just the days following marriage.  \n We should challenge our young people with these words and ask them the question: Are you being faithful to your future husband/wife, today?  \n The time to start building trust with one’s spouse isn’t after multiple relationships in the local youth group, more relationships in the college group, and then on to marriage.  \n We are called to do good to our spouses all the days of our lives.  \n Give Your Young People a Vision of Their Future Spouse  \n Give your young people (we start very early in our home) a vision of their future spouse, and how they can start being faithful, today, with how they live and interact with others.  \n Kissing and touching another person is physically gratifying – something God is highly in favor of . . . in marriage. See Song of Songs.  \n But, there is simply no biblical basis for physically gratifying yourself with someone who isn’t your spouse. For those who wish to make the argument that kissing and touching outside of marriage are no big deal, they must do so without the Scriptures, consulting their own reasoning. No serious believer can take this approach. The Bible informs Christians how to live.  \n I’m reminded of a well-known unmarried couple at a prominent, very conservative Christian college. They make great cause defending their studying of each other’s anatomy using the braille system. Passionate kissing? No problem. It’s perfectly fine, just an individual choice, like which toothpaste you prefer. Prior to their current squeeze, both young man and woman have had multiple similar relationships.  \n When I first heard of them, they were quite taken with each other. Marriage was definitely in the works. Next update had them going separate ways. It just wasn’t working out (where was God leading next?). Recently I’ve heard they are back together but not sure if they will get married.  \n But What if We’re Going to Get Married?  \n These well-educated, untaught, foolish young people are poster children for why, unless you’ve pledged your lives to each other, before God, you shouldn’t be physically involved. The Christian world is littered with relationships where marriage was “certain” and the young people involved, living in this narrative, gave themselves to each other to one degree or another, only to part ways and marry someone else.  \n We too lightly pass over God’s standard for every true child of His.  \n But as he who called you is holy, so be holy in all your conduct.  \n 1 Peter 1:15  \n Kissing and touching your spouse is holy conduct. Kissing and touching others isn’t. Taking what belongs to someone else is always wrong. Giving what belongs to your spouse, present or future, to someone else is also wrong.  \n The only rule of thumb necessary is: Be faithful to your spouse before you meet him/her and after you’re married to him/her.  \n Christian young people who are taught and live by this biblical principle will never regret it."
			}
		],

		"gender": [
			{
				"type": "post",
				"title": "Extra genders do not, and should not exist ",
				"text": "Anything beyond male and female does not, and should not exist. There are two genders. Let me explain: A person could be a man but his personality and traits are extremely feminine. But the truth is, he's still male whether he wants to be or not. He's just a male with many feminine tendencies. I'm fine with trans people who are truly committed to transitioning to the opposite sex. But a person changing 'just' their gender is an absolute crock of shit and something I do not 'tolerate' or ‘accept.' IMO most people who either think they can be a man and force people to call them a woman, or want to be something other than male or female (genderqueer, non-binary), think they're such a special and unique exception, that they can't possibly succeed in life as a male or female. Sorry but your thoughts and feelings DO NOT change what you truly are. No one is denying these peoples' identities. They are denying their own identities (male/female)! The problem is these people are just refusing to believe that they could possibly be male/female, because they can't just accept the fact that they are weird so it's going to be hard for them to find people who like them and want to be around them. But guess what? Everyone has problems. Try being short, fat, or ugly. Can you identify as tall just because you hate being short? No. Can you identify as skinny, just because you hate being fat? No. Can you identify as pretty, just because you hate being ugly? NO! But there are things you can do to cope. Short? Well tbh you're kind of fucked but maybe try and hang out with shorter people. Fat? Eat less, go to gym, see a dietitian, personal trainer. Ugly? Skin care products, fashion style, plastic surgery. The difference is, for these 'genderqueer' fucks, they're too special, arrogant, and entitled to be able to just suck it up and work harder to either improve the things they don't like about themselves, or search harder for people who do like them for who they are (like a reasonable person would). No. Instead of putting in blood, sweat, and tears, they'd rather try to force society to cater to their feelings, and create new gender classifications completely centered around themselves so that they can feel totally 'normal' even though they're still weirdos and even they themselves know it deep down. But I don't buy into this shit. They aren't fooling me."
			},
			{
				"type": "post",
				"title": "The word 'gender' should be removed out of all dictionaries", 
				"text": "It is basically a synonym for biological sex. +it makes people do all this bullshit with genders like being agender and all those fake thousands of genders that people make up to feel special like little children in kindergarden"

			},
			{
				"type": "post",
				"title": "I don't care whether there are 2 genders or 1000",
				"text": "Everyone seems to have an opinion on this. Why does it matter? If someone was born a female but does not want to be called a female, then why does it bother people? I am completely indifferent to this, and I don't see many people taking this stance. Whether there a 2 genders or many more makes no difference to me whatsoever, as long as you yourself are happy, what gives you the right to bash the way someone else lives their life? Not saying I personally believe in their being more genders, just saying I really don't care"
			},
			{
				"type": "post",
				"title": "My husband is in charge + I'm okay with that",
				"text": "If a man wants to have a baby, and the woman doesn't, the woman can just go terminate it. The man has little to no say in it whatsoever. If the man doesn't want to have the baby, and the woman does, however, there's nothing he can do. If he stays, he has to become a father, when he clearly doesn't want to be one. If he leaves, he has to pay child support. Up until the point that women can't terminate the pregnancy any longer, men should be able to fully relinquish all parental rights and duties, with no strings attached. A few signatures, and he's out for good. No child support, no visitation, just gone forever. If a woman can end the pregnancy without the man's consent, a man should be able to leave a relationship with a pregnant woman with zero consequence."
			},
			{
				"type": "post",
				"title": "Men should beat their wives",
				"text": "Before you begin with redpill or MRM accusations. I strongly beleive that TRP and the MRM movements are symptoms of larger problems rather than solutions to those problems. Basically those groups and movements are rather semi political movements that complain about their lives, blame failures on feminism, talk about their insecurities and place hopes for a better future in a con man like Trump. I don't think these groups or movments are good for men because they don't focus on self improvement and taking back power. Our society is plauged with issues primarly steming from women. Men have to bare the burden of pleasing women and making a better life for women. This is all fine and dandy but as the movements like feminism grew in western society we see that men aren't getting reconized for their contributions and they're reduced to servatitude of women. Women have been come snowflakey, shallow and ultimately stubborned. Some women in particular see themselves as unfaultable beings that can do no wrong. They're illogical and don't back down when confronted with logic. This means that a man will be forced to comply. Obviously since the man can't meet up with the unrealistic and unsound complies of women. They tend to suffer greatly mentally. This is why you see more western men commiting mass murders, joining cults and ultimately commiting more suicide. Beating women is an outlet and a sign of dominance that women do need to understand their role in a family unit. Christanity, Juadism and Islam ALL allow the man to hit women. It was only around 1910 that changed. Nature shouldn't be changed for women and feminist idealogies. Men should be in control and women should comply to a man's logical statements instead of using emotional arguments. The role of women should be understoodin society. Transgenderism wouldn't be an issue if men hit women. Young men wouldn't want to transition if they knew that they can be smacked. Quota's wouldn't block young men from working and radical feminsm would be brush under the rug. Women wouldn't drive men to suciede and mental illness if men were allout to naturally express themselves.. Overall hitting women is a nessarily asspect in society and shouldn't be shunned. My Dad does it and my mom stayed with him for 20+ years. How many marriages you can say last for 20+ years. Not many."
			},
			{
				"type": "post",
				"title": "There are only 3 genders",
				"text": "Male, female, neutral. There have always been 3 and there will always be 3. People who understand the 'romantic' languages, such as Spanish and French, are not confused by this because they understand that even words have genders. Gender has nothing to do with sexuality. Sorry if I offended anyone."
			},
			{
				"type": "post",
				"title": "Women's rights in the past 6 years have just been a platform where women can be rude as hell with no consequences",
				"text": "Not trying to suggest there isn't work to be done in attaining equality for all. But I find a lot of these public events just excuses for women to slander men with no consequences and then if you were to reply back at all you're the devil and they gang up on you and act like children. It's immature and an example of what toxic femininity is."
			},
			{
				"type": "post",
				"title": "Saying bad things or sharing negative opinions about girls and women here is not even close to unpopular",
				"text": "It's probably one of the most popular things you could do, almost anywhere on reddit. Honestly just search up the words girls, boys, men, and women. Check out the top results. The most upvoted ones of all time on this sub, that are also at least 80% and up positive, either have to do with or says something along the lines of -girls/ women are so >insert negative trait here< girls/ women are more >insert negative trait apparently attributed often to men< girls/ women are 'not oppressed' or >insert positive trait< Any rant about how awful feeeeeeeemales are in general, ignoring bad guys cuz only women are >insert negative traits here<, apparently. The more confirmation bias the better Guys are the true oppressed ones/ have it worse than women"
			},
			{
				"type": "post",
				"title": "Women should not play video games if they are worried about sexual harassment.",
				"text": "I'm sick of hearing dumb ass female feminazis talking about sexism and being sexually harassed by other players in video games. If they don't want to get harassed or see something 'sexist', then they can either grow a pair, pretend to be male (to avoid sexual harassment), or stop playing video games altogether. Men created video games as a male space and women have ruined it by invading their space. I'm hearing women whining about being groped in virtual reality now and honestly, if you are a female, don't play VR if you are just going to complain about being groped. Or use a male avatar and don't talk so nobody will know your gender FFS."
			},
			{
				"type": "post",
				"title": "I believe that everyone should be biologically female",
				"text": "I feel like that people are beginning to hate men, and I think rightly so. Men have oppressed women over the centuries that humanity existed, or at least have had it better than women and justified it (sometimes unfairly). I also think that people hate men because they're ugly and cold - also, most men tend to be the perpetrators of sexual abuse. What I envy from women aside from their appearance and personality, and how they're appreciated for that, is also how they have a low sex drive. These days, religious institutions would favour them a bit more on the basis of them having a generally lower sex drive, but I don't really like religious institutions much since they continue this anti-woman status. Feminists would generally like it if men were less able to rape or whatever. The far-right just want to take society back to the past and I'm worried they're gaining influence. I don't want what the far-right stand for to be realised. I believe that at this point in time, we should work towards making society more androgynous as well with technology being able to do many of the roles that would have once been dedicated to one sex. There's a reason why people like lesbians but not gay men - no one seems to want men, and if they do, it's to make men be men and women be women (which I don't want considering how much I envy women). Women also look better in a variety of looks compared to men. Men don't have it as great in terms of self-expression, at least outside the Middle East and other parts of Asia."
			},
			{
				"type": "article",
				"title": "Men Love Commitment",
				"text": "Since the idea of a dowry went extinct, men have been under fire from women for one thing more than any other: a phobia of commitment. Like stuck walruses, women scream that men have a fear of commitment; a fear that is childish and in constant odds with our biological impulse to screw anything that walks.  \n  That’s bullshit.  \n  Men love commitment.  \n  Men commit faster and with more enthusiasm than any other creature on Earth. Every time I see a starving dog attack a bowl of food, I think of a man committing to something. Intense!  \n  Marriage is not the definition of commitment.  \n  A wife takes the same amount of commitment as a house plant. All you have to do is keep her well watered with money and in fifty years she’ll blossom into a ripe old prune. That doesn’t sound like commitment. That sounds like a chore.  \n  Below are some man tasks I’ve compiled to demonstrate man’s love for commitment. But that’s not all I’ll be shoving up women’s ass. These things also show conclusively that men rush into commitments faster, with more zeal, and with a greater ability to live up to them than women.  \n  Men are better than women at commitment.  \n  Business  \n  1.6 men start a business for every one woman who does the same. (1)  \n  The first rule of running a restaurant is, 'be there every night.' The first rule of running a business is, 'think about your business every goddamn second of your life.' And starting a business is a commitment men make 60% more than women.  \n  The business world is a world lacking in pink rubber iPod cases and purses big enough for dogs. The business world is also not built on failure or shopping all day out of a Williams-Sonoma catalog. That’s never made anyone but Williams-Sonoma rich and I’m not even sure he’s a real guy.  \n  The Army  \n  Women make up 15% of the Army (2)  \n  An average of 15% of the Army, Navy, and the Marines, has been infiltrated by America’s lesser half.  \n  As far as commitments go, marrying Uncle Sam is a lot like marrying a woman. Except with Uncle Sam, there are no presents, no honeymoon, and no one starts saving for college when some dick head in a turban launches a mortar shell up your ass.  \n  Congratulations, soldier. It’s a boy!  \n  If men are so afraid of commitment, then why are they joining the world’s combat forces like war has a pair of tits?  \n  The army proves men are better than women at everything. Men are emotional even though women say we’re not, men are not afraid of commitment when commitment needs doing, and if you don’t like that, the army will defend your right to do so. A woman would never do that.  \n  The Wage Gap  \n  Women earn an average of $0.74 for every $1 earned by men. (3)  \n  Fuck the wage gap. Mexican day-laborers get paid a fraction of what licensed, unionized contractors do, and what happened there? Mexican day-laborers replaced unionized contractors whenever possible.  \n  The key words there are 'whenever possible'.  \n  Women employees cost 25% less than male employees — and they have boobs. Since this is America and not Candy Land, where basic economic principles no longer apply, that means only one thing: female workers must replace male workers whenever possible.  \n  They do. Female workers replace male workers whenever possible.  \n  Female workers replace male workers when answering phones and baby sitting children in day care. Female workers replace male workers when teaching children shit they will never need outside of watching Jeopardy and understanding the jokes on the Daily Show. Female workers replace male workers when men haven’t invented a robot who can do the job for free and without calling in sick because of their robo-period.  \n  Female workers replace male workers whenever a commitment to competence isn’t needed. The wage gap proves men love commitment. We’ll invest the time it takes to be needed.  \n  Investments  \n  'Many women tend to neglect their financial and retirement planning. By ignoring their financial and investment education today, they seriously jeopardize their financial security later in life…' – David Braze, Financial Expert  \n  When it comes to making investments, women don’t do it. They can’t be bothered to commit to their own financial stability because they have vaginas, and women think a vagina is the only financial stability they need.  \n  Vagina futures, however, are unlike oil futures and myself. Vagina futures go down. And they start around 23.  \n  Even women who do invest are scared shitless of it. In fact, women are 50% more risk averse than men. That means women will choose inaction over action 50% more often simply because they are terrified of their choice being wrong.  \n  Terror is never a good business decision. It’s not a decision at all.  \n  Women save 75% less than men in their pensions, 50% less in their 401k’s, and are way less likely to know how much money they’ll need after they retire. (3)  \n  That makes sense. If women treat retirement like they treat clubbing, let’s just say it’s a good thing they’ll be able to remove their teeth.  \n  Being Awesome  \n  Sometimes a man’s gotta do what a man’s gotta do. Sometimes that means jumping the Snake River Canyon on a jet powered motorsled. And sometimes that means drinking a bunch of horse sperm. Don’t watch Jackass: Number Two if that sentence made you uncomfortable.  \n  Being Nicolas Cage takes a lifetime of commitment. Being Mrs. Jane Smith takes about six months of nagging.  \n  Manclusion  \n  If women had anything to offer, a man would sign a life-time lease faster than he could open a business or join the Army or buy a bunch of stocks. Women don’t though. Women are magazine subscriptions. They’re full of shit and they’re never good to pay for after a year.  \n  Men are not in the habit of pissing our valuable lives away on pointless bullshit. Men are also not in the habit of tying our dicks in a noose because some sweet looking girl smiles at our jokes for a week and gives a good BJ.  \n  That’s not called commitment. That’s called being psychotic.  \n  "
			},
			{
				"type": "quote",
				"title": "I Don't Respect Women Who Can't Cook",
				"text": ""
			},
			{
				"type": "quote",
				"title": "Children should be raised without gender",
				"text": ""
			},
			{
				"type": "quote",
				"title": "Gender roles are awesome.",
				"text": ""
			},
			{
				"type" : "quote",
				"title" : "Feminism has really ruined relationships, men do not want to behave like men anymore, and it has women confused and trying to play their gender role.",
				"text" : ""
			}
		],

		"lgbt": [
			{
				"type": "post",
				"title": "'Transgender women' experience nothing but first-world problems.",
				"text": "Only in the first world does a healthy, 6 foot tall, classically handsome man feel insecure about his looks. Only in the first world do men think about being the wrong gender; men have it much easier than women in 3rd-world countries. Only in the first world are gender-neutral bathrooms seen as progressive. In India, people are actually fighting for separate facilities since women have periods and face stigma in Indian gender-neutral bathrooms. Only in the first world does a man get sad that an overworked, underpaid sales associate called him 'sir', which used to just be a polite term for a man. If your biggest issue is that you're male and want to be female, you have a pretty easy life. The funny thing is how do they know? What is their baseline comparison for what it feels like to be a woman? How do you know you don't just feel like how a man is supposed to feel? In the past, when a growing boy wanted to be a woman, we told him that he was lucky to be a boy. Now, we tell him that he too can be a girl, and that we can fuck with his hormones and change his name to resemble a girl. Probably the most surprising thing is that some of these men are sad that they don't have female reproductive organs. It's an insult to the real women who were born without reproductive organs, or to those who lost them to cancer. These men, on the other hand, were born with (and probably still have) perfectly healthy male organs. And they can have their own kids, by FATHERING them. Fathering kids is THEIR role, motherhood is the female role, and you don't get to choose your role. That's not to say that homosexuality is wrong, or that reproduction is the only purpose of life. But when considering your gender, count your blessings. Your lack of a uterus means no periods. Your narrow hips enable better running. Your broad chest and IBTC breasts mean less back pain. Your male height is an advantage. Your deep voice is louder than a woman's voice. Your facial hair indicates you have high levels of testosterone. You're lucky to be a guy."
			},
			{
				"type": "quote",
				"title": "I strongly believe that homosexuality is rooted in and continuously shaped by social interactions.",
				"text": ""
			},
			{
				"type": "quote",
				"title": "The lgbt community is really too anti-religion",
				"text": ""
			}, 
			{
				"type":"quote", 
				"title": "The LGBT 'community' is gross and I don't want to be a part of it. I just want to be a normal lesbian.",
				"text": ""
			},
			{
				"type": "quote", 
				"title": "Women who date ‘butches’ are straight.",
				"text": ""
			},
			{
				"type": "post",
				"title": "I believe the vocal infamous minority of the lgbt community is responsible for the PC crap mainstream media is trying to push onto the internet and it can be traced back to the point when homosexuals achieved marriage rights in the US. ",
				"text": "Excuse my lack of proof, as I can't seem to find any objective information on the issue, so I have to confess that I made these connections based on my (potentially faulty in some cases) memories. First I heard about the same-sex marriage rights in the US, it was popping up on every social site I frequented at the time (namely Youtube, Facebook and 9Gag. please don't judge me.). Now don't get me wrong, I don't see anything wrong with this. I wasn't one of those cringy Facebook users that used the rainbow flag filter on their profile pics during that period of time, but I wasn't against homosexuals having the right to marry each other. I just think that this was only a catalyst for something bigger. So afterwards, everywhere I went the whole 'feminazi' and 'white men are scum' thing started popping up, while simultaneously the whole genderfluid debacle took some sites by storm and everybody started getting triggered left and right. I have a faint memory that some people pushing these things into the mainstream originated from the LGBT community, but, once again, only my opinion without any concrete proof. And this escalated to where we are now. Nowadays If you aren't from a site/subreddit/forum known for free speech and aversion to the genderfluid issue you have to be extremely careful about what you say on the internet, lest you end up getting lynched and proclaimed the next Lucifer. Especially on Youtube, since even some of the major YouTubers are getting hate for their non-PC vocabulary. I'm sorry if I offended anyone EDIT:, I don't want to sound like a pissed off asshole blaming the problems the internet is facing on a minority that fought long for a right they should have by default, but I can't shake the feeling that this all started with what homosexuals achieved back in 2015. More importantly, I apologize for my lack of concrete proof that will probably earn my post a place in the realm of the tinfoil conspiracies."
			},
			{
				"type": "post",
				"title": "Bisexuals are attracted to both genders, but moreso women. ",
				"text": "They can go without male involvement, but not female. Bis never truly marry males and live het, they just hitch on for the money and to make their parents happy; and they keep dating women. They make the choice for social and financial reasons. Most don't date rich women or women with status, or women who will totally support them and buy them x, y, and z. Put most in that situation and they wouldn't marry a male. It's about social status and money with them, not a relationship or social pressure."
			},
			{
				"type": "post",
				"title": "Being trans is just a fad",
				"text": "Proposition: Being trans nowadays is just a fad, with the majority of trans people 'coming out' because of today's cultural and political scenario, whereas in another era, they would simply be gay. So, I am not a scientist, or social scientist or whatever, I am just a Eng. grad student, so pardon me for not being clear with my explanations, but I hope you can still understand what I am trying to propose here.I've seen the increase in the number of trans people and it seems that many people would link this to increase in population (the more people in the world, the more trans), and to nowadays being more liberal (cultural liberties and political policies). I will get more on that second reasoning. I myself don't care about gender or stuff like that, if I feel attracted to someone regardless of what they call themselves, let's say 'I'd hit that’. Then I began 'entering' the trans world, many dating websites, asking IRL friends of friends who were trans, I went out with four girls, and although my sample size is small, I observed the following: Asia region has the most 'fake' (idk what word to use) trans ratio than everywhere else. Most appears to be trans just for the prostitution industry, they don't have medical guidance (relating to hormonal drugs, when they take them) -- Note: not that medical guidance is mandatory, but it is a good sign of someone genuinely concerned with their dysphoria --, and 2 of them I asked said they would be fine as a gay man instead. There is a lot of fetishism involved in this community. If you want to include crossdressers and the like (yeah, 50 year old dudes with a dress asking to be fucked), which I won't do, but I've seen that some claiming to be trans are clearly only in it for the sexual aspect of it, neglecting the mentality that a trans person has gender dysphoria. Of course I have met really nice people who I wish the best. There was a transwoman that was so excited to talk to me about her SRS (sex reassignment surgery), and another one who was legitimately confused with her gender and sexuality (she always liked boys but never felt a boy herself). Now I wanted to include the fact that maybe some of these people, gay in-before, are being misguided by everything around them (media, culture, friends) to think they are trans, when is not the case. In these cases, I question myself, can suicide rates in trans be partially due to this? (I don't dismiss prejudice and transphobia). Some claiming to be trans when they are just a man (okay okay, trans people not necessarily need to change all her appearance to that of a woman, but a man with beard cmon dont push it). And if I may include in my observation, even though I don't want it because it is, in my opinion a more aggravated case of this fad, the plethora of genders. I don't think anyone takes this seriously, but I wanted to point out this is somewhat a good thing if you are concerned about people mutilating themselves and then regretting it, this kinda gives the liberty to be whatever the fuck they feel they are, although this might be disguised as another identity issue (not dysphoria). So that's it, I am not the one that wants to point at someone and tell them they aren't something they believe and want to be, but I just wanted to put in in stone so to speak this phenomena that I've been observing. Mistakes were made while writing this, there's also bias probably, but I wanted to open this discussion either way."
			},
			{
				"type": "post",
				"title": "All trans should use female bathrooms",
				"text": "Republicans say trans women (as in born male, turned female) shouldn't be allowed in female bathrooms, because a rapist or a child molester could dress up as a woman and go in there.I would go the other way and say not only should trans women (born male, turned female) be allowed to use female bathrooms, but they should only use them. The real risk for an assault is a trans woman getting assaulted by a cis man, and making a trans woman use men's bathroom is making them go into the lion's den. Using female bathrooms is for their safety. I don't really care that a trans man (born female, turned male) doesn't get to use the bathroom they identify with, although if you made it so they get to use male bathrooms I'm fine with it I guess"
			},
			{
				"type": "post",
				"title": "Transgender is more about aesthetically fitting into a gender role than being who you feel.",
				"text": "I think it is possible that most people who identify as transgender have an issue with their current body type or sex because of what is traditionally defined as 'gender' roles for said sex. For example a man generally wanting to behave in a more of a 'feminine' nature and perhaps wear dresses or make up in public without facing ridicule or a woman who wants to behave or dress in more of a 'masculine' fashion, again, without facing judgement. Note that I put gender, masculine, and feminine in quotes because these are things that have no real point in our society outside of trying to categorize. Here's my point/question: What if we lived in a world where there were no such thing as classified gender roles outside of what is biologically necessary (i.e. women giving birth and men injecting seed)? Men and women being equal in every other aspect of society, would most transgender people still feel that their biological sex does not correlate with their mental image of who they are? If the answer is yes then it seems to me that having a sex change would be something more in line with a purely cosmetic surgery like having a nose job; changing something about yourself simply because you don't like it instead of accepting yourself for who you are. If the answer is no then I think that says more about how much progress we have yet to make as a whole that people feel the need to make such extreme changes in order to be accepted in society for who they are. Obviously this isn't true for all but I feel it is for most."
			},
			{
				"type": "post",
				"title": "I Suspect Everyone Is Bisexual",
				"text": "You're offered 3 photographs for appraisal, each of a nude or provocatively dressed person of the opposite sex. Each rate somewhere on a 10-scale for you, with 10 being extremely attractive, 5 being average or okay, and 1 being total horrorshow.Given a must choice between the three of who to have sex with, you would naturally pick 10 over 5 as surely as you would pick 5 over 1. Now let's replace the 10 photo with a 10 photo of someone of the same sex (let's assume it's a 10 on your scale, that you were forced to divide a pool of random photos among 10 ranks before the experiment). Who would you pick? Would the relatively attractive same sex 10 come second to the opposite sex 5? The 5 is just passing insofar as they are the opposite sex absent of other outstanding qualities which you would find attractive. Let's take it further... would you take the 1 over the 10? The 1 is not only unnattractive, but they explicitly put you off, they are simply disgusting in some way, hideous in such a manner as to retard every instinct you'd have to seek sex. The same sex 10, however, is as handsome or beautiful as you are likely to expect. Now let's press it a little further, they're not just photos, these are interviews. Let's suppose the same sex 10 has that sort of sexual charisma that knows what you like, can tease out your vulnerabilities, and is willing to go there with you, while the opposite 1 is simply an unpleasant troll of a person with some utterly bewildering, if not downright loathsome, idea of a sexual relationship? I would argue that you are either suicidal to choose the opposite sex 1, morbidly obsessed with certain genitals, or irrationally phobic of certain genitals. Surely not every man or woman turns you on? Surely there are some conditions by which you would concede to favor the same sex over the opposite sex? And if you're gay, simply reverse the sexes and see if the argument still applies.I've never met anybody who hasn't had standards, but I think it's a fair bet that even staunch heterosexuals would cave in a do-or-die scenario were society not to look unkindly on them for their choice."
			},
			{
				"type": "post",
				"title": "Straight people accusing LGBT people of shoveling sexuality down their throats are hypocritical",
				"text": "One of the most common criticisms of the LGBT community is that being gay becomes their whole personality and that they shovel their gayness down other peoples throats; however, 95% of what we consume today (in media, in society) is straight-oriented, and gay people have to 'deal' with straightness basically everyday. People accuse the LGBT community of defining themselves only through their sex life, and yet straight relationships make up a huge part of people's lives; finding a spouse/partner/SO is a MAJOR life goal for almost all of the population (excluding asexuals and other similarly-oriented people) and people talk about straight sex life all the time amongst each other. Of course, there are both gay and straight people that talk about their sex life to an obnoxious degree, but it seems when gay people mention even once them being gay and all the baggage that comes with it they get called out much more than super sex-oriented straight people"
			},
			{
				"type": "post",
				"title": "You are not LGBTQ whatever. You are a person.",
				"text": "Title really says it all. Internalizing fetishes does not seem healthy to me, and to the point where they become your identity is lunacy. Stop trying to separate yourself from the rest of the population, you aren't 'a gay person' you are just a person. I feel it has a degrading effect on society to be constantly grouping ourselves up and pointing fingers at one another. We are more similar than we are different. I don't care what happens in your bedroom. I do care when you start using it as an excuse to separate yourself and proclaim your sexuality is an identity. It isn’t. If there wasn't such a push for separate communities I doubt the frequency of alternative sexualities would be nearly as high. There is something alluring about being part of a group, especially ones that seem to enjoy special rights, or at the very least seem to be handled with kid gloves. Trans people get a lot of attention, period. I am not saying that is why all trans are trans, I am just saying they get a lot of attention. So say you were an attention whore and just liked to be paid attention to, why not dress up in the other gender's clothing and declare yourself trans? You don't even have to be gay. You can be a 'trans' woman who loves men but dresses like a dock worker. So at what point does it become more about the attention than about the intention?"
			},
			{
				"type": "post",
				"title": "If gay conversion therapy was real / worked, I would gladly go",
				"text": "Whether you are liberal or conservative, if you have some reason, you should understand that those therapies do not work. You can't change people, you can't change their desire or their natures. You can't pray or torture it away. It just doesn't work like that. If it did work like that though, if after enough sessions of prayer or suffering or videos or indoctrination, you could become straight, I would go. I don't care about how shitty it could get, if I could get a normal life, I could have a wife and kids and be happy, no longer need to struggle, live like all of my friends do and don't have to worry about my future and long term, believe me, I would not think twice."
			},
			{
				"type": "post",
				"title": "I don't give a shit about homosexual relationships",
				"text": "Which isn't to say I don't like homosexuals, or that I think they're inferior, or that they don't deserve the same rights as everybody else. Of course they do. And I'd happily fight for those rights. I just... don't have any interest in hearing about them fucking each other. I'm on Tumblr (first mistake, I know) and it's just... no matter who it is, suddenly every single character in every book, every television show, and every movie, is SO OBVS gay. All of them. Every one. Is he married? Uh, DOESN'T MATTER, because his wife is a bitch and he's clearly in love with this other dude, who is also obvs gay. Even though in canon they're not. Like, it's unthinkable to have an equal ratio of characters of different sexualities. All of them have to be gay. ALL OF THEM. EVEN ONES FIRMLY ESTABLISHED AS STRAIGHT. What's that? You don't care about a cast of ALL GAY CHARACTERS? WHAT SORT OF HORRIBLE HOMOPHOBIC SHITLORD ARE YOU??? How about two guys fucking each other just does nothing for me, and I'm not into it? I'm supposed to PRETEND that it does? You know what, if you're a straight person who is SUPER into gay sex, AWESOME FOR YOU. Go have fun with that, that is great. But trying to turn it into some social justice movement is just weird. It's a fetish. There's nothing wrong with having a fetish. There's also nothing wrong with not needing to hear detailed descriptions of two lesbians going at it, or how so-and-so is obvs 'a power bottom', or… I feel like a freak for thinking of homosexuals as normal human beings, and not sexual objects."
			},
			{
				"type": "post",
				"title": "Whether or not you believe in trans rights or more than 2 genders, gendered bathrooms are stupid.",
				"text": "I hate the fact that I can’t just use whatever bathroom has empty stalls without getting dirty looks. I have a small bladder and it’s painful and annoying to wait forever for a stall when there’s like three open ones in the next bathroom over. The point of bathrooms is to piss and shit. Yeah males can stand while they piss and females bleed monthly, but to me it doesn’t make much of a difference. Everyone no matter their junk uses a sitting toilet at home, and putting a trash can in every stall isn’t super inconvenient and honestly isn’t a horrible idea. I don’t care about other people’s genitals when I’m about to wet my pants. Let me pee!!!"
			},
			{
				"type": "quote",
				"title": "the word queer is redundant and dehumanizing ",
				"text": ""
			}
		],
		"about" : [
			{
				"type" : "quote",
				"title" : "This is the third issue of Out There Mag.",
				"text": ""
			},
			{
				"type" : "quote",
				"title" : "This issue focuses on unpopular opinions about love, sex, and relationships.",
				"text": ""
			}

		]
	}
}




